#### Terraform Plan

<details><summary>Show Plan</summary>

```
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRole_5F3056C5: Refreshing state... [id=terraform-20230727204725916100000001]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRole_CBB68D47: Refreshing state... [id=terraform-20230808003212924500000001]
aws_s3_bucket.Code: Refreshing state... [id=code-c84a50b1-20230727202411678600000003]
aws_iam_role.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRole_0FF833EF: Refreshing state... [id=terraform-20230803215115569800000002]
aws_iam_role.InitializeTable_Function_IamRole_E3F0843D: Refreshing state... [id=terraform-20230727202411672600000001]
aws_dynamodb_table.VotingAppStore_Items_tfawsdynamodbTableDynamodbTable_3639CE64: Refreshing state... [id=Items-591d973a]
aws_cloudfront_origin_access_control.cloudWebsite_CloudfrontOac_C956968B: Refreshing state... [id=E1J2GO7P2VQ2EZ]
data.aws_region.Region: Reading...
aws_s3_bucket.cloudWebsite_WebsiteBucket_EB03D355: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
data.aws_region.Region: Read complete after 0s [id=us-east-1]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicy_25C9720E: Refreshing state... [id=terraform-20230727204725916100000001:terraform-20230727204739773400000005]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-41f14472_IamRolePolicyAttachment_E1980EB1: Refreshing state... [id=terraform-20230727204725916100000001-20230727204726450200000003]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicy_2D34FA97: Refreshing state... [id=terraform-20230803215115569800000002:terraform-20230803215115813700000003]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicyAttachment_92A90320: Refreshing state... [id=terraform-20230808003212924500000001-20230808003213158800000002]
aws_iam_role_policy.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_IamRolePolicy_0F307DC9: Refreshing state... [id=terraform-20230808003212924500000001:terraform-20230808003225755300000003]
aws_iam_role_policy_attachment.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_IamRolePolicyAttachment_055C2EDA: Refreshing state... [id=terraform-20230803215115569800000002-20230803215115890800000004]
aws_iam_role_policy_attachment.InitializeTable_Function_IamRolePolicyAttachment_4435DE19: Refreshing state... [id=terraform-20230727202411672600000001-20230727202411887400000005]
aws_iam_role_policy.InitializeTable_Function_IamRolePolicy_2AD89519: Refreshing state... [id=terraform-20230727202411672600000001:terraform-20230727202424567600000008]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6: Refreshing state... [id=asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.fce0ddf67b59658d8eb99b0b9dd1b1bf.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9: Refreshing state... [id=asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.780f28ff1af64c4582c2475857a2a00f.zip]
aws_s3_object.InitializeTable_Function_S3Object_F5933D3B: Refreshing state... [id=asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9c8c91674f6483e648e2b983948e59d3.zip]
aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004: Refreshing state... [id=asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.35b6635a7f96478c81ae826e2aff5261.zip]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52: Refreshing state... [id=VotingAppApi-OnRequest-8d2e75ec-c8cf8e09]
aws_s3_object.cloudWebsite_File--logo512png_E26C5AA3: Refreshing state... [id=/logo512.png]
aws_s3_object.cloudWebsite_File--robotstxt_F93900E9: Refreshing state... [id=/robots.txt]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjs_40889769: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js]
aws_cloudfront_distribution.cloudWebsite_Distribution_083B5AF9: Refreshing state... [id=E1QUV69RQ9ODON]
aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjs_7B16084A: Refreshing state... [id=/static/js/main.f4c8898c.js]
aws_s3_object.cloudWebsite_File--faviconico_A86052F9: Refreshing state... [id=/favicon.ico]
aws_s3_object.cloudWebsite_File--manifestjson_5AC33197: Refreshing state... [id=/manifest.json]
aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsmap_0538E57B: Refreshing state... [id=/static/js/main.f4c8898c.js.map]
aws_s3_object.cloudWebsite_File--asset-manifestjson_8187FE70: Refreshing state... [id=/asset-manifest.json]
aws_s3_object.cloudWebsite_File--indexhtml_2A2AE13C: Refreshing state... [id=/index.html]
aws_s3_bucket_server_side_encryption_configuration.cloudWebsite_Encryption_6A8A4E29: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--static--js--mainf4c8898cjsLICENSEtxt_CF173BC8: Refreshing state... [id=/static/js/main.f4c8898c.js.LICENSE.txt]
aws_s3_object.cloudWebsite_File--logo192png_6E513B20: Refreshing state... [id=/logo192.png]
aws_s3_bucket_website_configuration.cloudWebsite_BucketWebsiteConfiguration_920E8E41: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--static--css--maine6c13ad2cssmap_DFBF7C37: Refreshing state... [id=/static/css/main.e6c13ad2.css.map]
aws_s3_object.cloudWebsite_File--static--js--78728cb0dcdchunkjsmap_F5D0643F: Refreshing state... [id=/static/js/787.28cb0dcd.chunk.js.map]
aws_s3_bucket_public_access_block.cloudWebsite_PublicAccessBlock_18A70311: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_s3_object.cloudWebsite_File--static--css--maine6c13ad2css_F3967298: Refreshing state... [id=/static/css/main.e6c13ad2.css]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289: Refreshing state... [id=VotingAppApi-OnRequest-41f14472-c87bddf9]
aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6: Refreshing state... [id=VotingAppApi-OnRequest-52bc3c17-c89daf14]
aws_lambda_function.InitializeTable_Function_FD00736D: Refreshing state... [id=Function-c8e7055b]
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Reading...
data.aws_iam_policy_document.cloudWebsite_AllowDistributionReadOnly_89DC4FD0: Read complete after 0s [id=573591717]
aws_s3_bucket_policy.cloudWebsite_DistributionS3BucketPolicy_32B029AE: Refreshing state... [id=cloud-website-c8e58765-20230803215115368500000001]
aws_api_gateway_rest_api.VotingAppApi_api_CB41EC98: Refreshing state... [id=dfh6uhtoa0]
aws_lambda_permission.VotingAppApi_api_permission-POST-53dc1f64_98751060: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-53dc1f64]
aws_lambda_permission.VotingAppApi_api_permission-POST-57590acc_3E83C8F6: Refreshing state... [id=AllowExecutionFromAPIGateway-POST-57590acc]
aws_lambda_permission.VotingAppApi_api_permission-GET-60cabf0c_A106D13D: Refreshing state... [id=AllowExecutionFromAPIGateway-GET-60cabf0c]
aws_api_gateway_deployment.VotingAppApi_api_deployment_B9647894: Refreshing state... [id=1e60l0]
aws_api_gateway_stage.VotingAppApi_api_stage_9B2FA9EA: Refreshing state... [id=ags-dfh6uhtoa0-prod]
aws_s3_object.cloudWebsite_File-configjson_591A81BA: Refreshing state... [id=config.json]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.InitializeTable_Invocation_6E01246F will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_lambda_invocation" "InitializeTable_Invocation_6E01246F" {
      + function_name = "Function-c8e7055b"
      + id            = (known after apply)
      + input         = jsonencode({})
      + result        = (known after apply)
    }

  # aws_lambda_function.InitializeTable_Function_FD00736D will be updated in-place
  ~ resource "aws_lambda_function" "InitializeTable_Function_FD00736D" {
        id                             = "Function-c8e7055b"
      ~ last_modified                  = "2023-08-08T00:32:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:5" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:Function-c8e7055b:5/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9c8c91674f6483e648e2b983948e59d3.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.1f86818cb01db09258fcdc0f5bf4e614.zip"
        tags                           = {}
      ~ version                        = "5" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-41f14472_39478289" {
        id                             = "VotingAppApi-OnRequest-41f14472-c87bddf9"
      ~ last_modified                  = "2023-08-08T00:32:37.554+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-41f14472-c87bddf9:4/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.780f28ff1af64c4582c2475857a2a00f.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.bcfa5c1cce14283beacf9498a28ee05d.zip"
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_02CD08E6" {
        id                             = "VotingAppApi-OnRequest-52bc3c17-c89daf14"
      ~ last_modified                  = "2023-08-08T00:32:37.553+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:1" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-52bc3c17-c89daf14:1/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.fce0ddf67b59658d8eb99b0b9dd1b1bf.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.5eb0b36acd8ea3a2c682fb4bee0b6519.zip"
        tags                           = {}
      ~ version                        = "1" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52 will be updated in-place
  ~ resource "aws_lambda_function" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_93510F52" {
        id                             = "VotingAppApi-OnRequest-8d2e75ec-c8cf8e09"
      ~ last_modified                  = "2023-08-08T00:32:31.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:3" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:223316951128:function:VotingAppApi-OnRequest-8d2e75ec-c8cf8e09:3/invocations" -> (known after apply)
      ~ s3_key                         = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.35b6635a7f96478c81ae826e2aff5261.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.b3db1ea71d11c30c9168e067bd4f76b3.zip"
        tags                           = {}
      ~ version                        = "3" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_s3_object.InitializeTable_Function_S3Object_F5933D3B must be replaced
-/+ resource "aws_s3_object" "InitializeTable_Function_S3Object_F5933D3B" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "e00e4b6959902cfe97941a7ae265a87a" -> (known after apply)
      ~ id                     = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9c8c91674f6483e648e2b983948e59d3.zip" -> (known after apply)
      ~ key                    = "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.9c8c91674f6483e648e2b983948e59d3.zip" -> "asset.c8e7055bb3773d297f63b5172fb6a571cddc069012.1f86818cb01db09258fcdc0f5bf4e614.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/InitializeTable_Function_Asset_1A1B5BC3/9C8C91674F6483E648E2B983948E59D3/archive.zip" -> "assets/InitializeTable_Function_Asset_1A1B5BC3/1F86818CB01DB09258FCDC0F5BF4E614/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-41f14472_S3Object_C95F6BA9" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "63524ce7ff84b26f5bc0dfb9cb15bdd6" -> (known after apply)
      ~ id                     = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.780f28ff1af64c4582c2475857a2a00f.zip" -> (known after apply)
      ~ key                    = "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.780f28ff1af64c4582c2475857a2a00f.zip" -> "asset.c87bddf927b70f22f963a14d64ce5f4bf1372d398a.bcfa5c1cce14283beacf9498a28ee05d.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/780F28FF1AF64C4582C2475857A2A00F/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-41f14472_Asset_94F55D63/BCFA5C1CCE14283BEACF9498A28EE05D/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-52bc3c17_S3Object_F3A42DC6" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "a995f85ec9128f0864709c81f5286534" -> (known after apply)
      ~ id                     = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.fce0ddf67b59658d8eb99b0b9dd1b1bf.zip" -> (known after apply)
      ~ key                    = "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.fce0ddf67b59658d8eb99b0b9dd1b1bf.zip" -> "asset.c89daf14978fb4fcb47ef703ae9610992b519c2727.5eb0b36acd8ea3a2c682fb4bee0b6519.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/FCE0DDF67B59658D8EB99B0B9DD1B1BF/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-52bc3c17_Asset_FBAD96D6/5EB0B36ACD8EA3A2C682FB4BEE0B6519/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

  # aws_s3_object.VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004 must be replaced
+/- resource "aws_s3_object" "VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_S3Object_F8CCE004" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "987500c87f97756ecbb20bb5a9c394a1" -> (known after apply)
      ~ id                     = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.35b6635a7f96478c81ae826e2aff5261.zip" -> (known after apply)
      ~ key                    = "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.35b6635a7f96478c81ae826e2aff5261.zip" -> "asset.c8cf8e09741b572c80a663f9c8cf9ce40395e87b08.b3db1ea71d11c30c9168e067bd4f76b3.zip" # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/35B6635A7F96478C81AE826E2AFF5261/archive.zip" -> "assets/VotingAppApi_VotingAppApi-OnRequest-8d2e75ec_Asset_4A29FD21/B3DB1EA71D11C30C9168E067BD4F76B3/archive.zip"
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 4 to change, 4 to destroy.

```

</details>
